mbox54/FT_DSADModService/DSMCUService/ADUC7029_XFP_WDM_CONF_ENGI.cpp
// ADUC7029_XFP_WDM_CONF_ENGI.cpp : implementation file
//

#include "stdafx.h"
#include "DSMCUService.h"
#include "ADUC7029_XFP_WDM_CONF_ENGI.h"
#include "afxdialogex.h"


// CADUC7029_XFP_WDM_CONF_ENGI dialog

IMPLEMENT_DYNAMIC(CADUC7029_XFP_WDM_CONF_ENGI, CDialog)

CADUC7029_XFP_WDM_CONF_ENGI::CADUC7029_XFP_WDM_CONF_ENGI(CWnd* pParent /*=NULL*/)
	: CDialog(IDD_PROPPAGE_ADUC7029_XFP_WDM_CONF_ENGI, pParent)
	, m_sEdit_PassValue(_T(""))
	, m_Edit_Filename(_T(""))
{

}

CADUC7029_XFP_WDM_CONF_ENGI::CADUC7029_XFP_WDM_CONF_ENGI(HID_SMBUS_DEVICE * pHidSmbus, CProgressCtrl * p_cPB_OP, CEdit * p_EDIT_STATUS, st_serviceData * p_service, CWnd * pParent)
	: CDialog(IDD_PROPPAGE_ADUC7029_XFP_WDM_CONF_ENGI, pParent)
, m_pHidSmbus(pHidSmbus)
, p_EDIT_STATUS(p_EDIT_STATUS)
, p_cPB_OP(p_cPB_OP)
, p_service(p_service)
, m_Grid(m_pHidSmbus, p_cPB_OP, p_EDIT_STATUS, p_service)
{

}

CADUC7029_XFP_WDM_CONF_ENGI::~CADUC7029_XFP_WDM_CONF_ENGI()
{

}


void CADUC7029_XFP_WDM_CONF_ENGI::Trace(LPCTSTR szFmt, ...)
{
	CString str;

	// Format the message text
	va_list argptr;
	va_start(argptr, szFmt);
	str.FormatV(szFmt, argptr);
	va_end(argptr);

	str.Replace(_T("\n"), _T("\r\n"));

	CString strWndText;
	p_EDIT_STATUS->GetWindowText(strWndText);
	strWndText += str;
	p_EDIT_STATUS->SetWindowText(strWndText);

	//	m_TraceWnd.SetSel(str.GetLength()-1, str.GetLength()-2, FALSE);
	p_EDIT_STATUS->LineScroll(-p_EDIT_STATUS->GetLineCount());
	p_EDIT_STATUS->LineScroll(p_EDIT_STATUS->GetLineCount() - 4);
}



void CADUC7029_XFP_WDM_CONF_ENGI::OnHScroll(UINT nSBCode, UINT nPos, CScrollBar* pScrollBar)
{
	// TODO: Add your message handler code here and/or call default
	CWnd *pSliderBIAS = this->GetDlgItem(IDC_SLIDER_BIAS);
	CWnd *pSliderMOD = this->GetDlgItem(IDC_SLIDER_MOD);

	if (pScrollBar == pSliderBIAS)			//  BIAS Slider
	{
		// get static components
		CWnd *pStaticBIAS = this->GetDlgItem(IDC_STATIC_BIAS);

		// > Update contents for Read controls
		UpdateData(TRUE);

		// > Control MAIN slider
		// Get current Slider position
		WORD ucPos = this->m_Slider_BIAS.GetPos();

		// convert to str
		CString str1;
		str1.Format(L"%d", ucPos);

		// Out to Interface control Label
		pStaticBIAS->SetWindowTextW(str1);

		// Out to Interface control Edits
		unWORD_2BYTE buf_value;

		buf_value.usValue = ucPos;

		// Convert to String Hex
		// Out in Edits
		CString str_hex;
		str_hex.Format(_T("%02X"), buf_value.ucValue[1]);
		this->m_Edit_Bias_H.SetWindowTextW(str_hex);

		str_hex.Truncate(0);

		str_hex.Format(_T("%02X"), buf_value.ucValue[0]);
		this->m_Edit_Bias_L.SetWindowTextW(str_hex);

		// > Update interface for Write controls
		UpdateData(FALSE);
	}

	if (pScrollBar == pSliderMOD)			//  MOD Slider
	{
		// get static components
		CWnd *pStaticMOD = this->GetDlgItem(IDC_STATIC_MOD);

		// > Update contents for Read controls
		UpdateData(TRUE);

		// > Control MAIN slider
		// Get current Slider position
		WORD ucPos = this->m_Slider_MOD.GetPos();

		unWORD_2BYTE buf_value;

		buf_value.usValue = ucPos;

		// convert to str
		CString str1;
		str1.Format(L"%d", ucPos);

		// Out to Interface control Label
		pStaticMOD->SetWindowTextW(str1);

		// Out to Interface control Edits

		// Convert to String Hex
		// Out in Edits
		CString str_hex;
		str_hex.Format(_T("%02X"), buf_value.ucValue[1]);
		this->m_Edit_Mod_H.SetWindowTextW(str_hex);
		
		str_hex.Truncate(0);
		str_hex.Format(_T("%02X"), buf_value.ucValue[0]);
		this->m_Edit_Mod_L.SetWindowTextW(str_hex);

		// > Update interface for Write controls
		UpdateData(FALSE);
	}


	CDialog::OnHScroll(nSBCode, nPos, pScrollBar);
}


void CADUC7029_XFP_WDM_CONF_ENGI::OnVScroll(UINT nSBCode, UINT nPos, CScrollBar* pScrollBar)
{
	// TODO: Add your message handler code here and/or call default

	CDialog::OnVScroll(nSBCode, nPos, pScrollBar);
}



void CADUC7029_XFP_WDM_CONF_ENGI::SliderInit()
{
	// var for label OP
	CString str;

	// BIAS
	// slider
	m_Slider_BIAS.SetRange(VALUE_BIAS_MIN, VALUE_BIAS_MAX);
	m_Slider_BIAS.SetPos(VALUE_BIAS_DEF);

	// label
	// get static components
	CWnd *pStaticBIAS = this->GetDlgItem(IDC_STATIC_BIAS);
	CWnd *pStaticBIAS_MIN = this->GetDlgItem(IDC_STATIC_BIAS_MIN);
	CWnd *pStaticBIAS_MAX = this->GetDlgItem(IDC_STATIC_BIAS_MAX);

	// set Values
	str.Format(L"%d", VALUE_BIAS_MIN);			// Set & Convert
	pStaticBIAS_MIN->SetWindowTextW(str);		// Out to Interface control 

	str.Format(L"%d", VALUE_BIAS_MAX);			// Set & Convert
	pStaticBIAS_MAX->SetWindowTextW(str);		// Out to Interface control 

	str.Format(L"%d", VALUE_BIAS_DEF);			// Set & Convert
	pStaticBIAS->SetWindowTextW(str);			// Out to Interface control 

	// edit 
	// config
	this->m_Edit_Bias_H.LimitText(2);
	this->m_Edit_Bias_L.LimitText(2);

	// fill with Value
	unWORD_2BYTE buf_value;

	buf_value.usValue = VALUE_BIAS_DEF;

	// place Values
	CString str_hex;
	str_hex.Format(_T("%02X"), buf_value.ucValue[1]);
	this->m_Edit_Bias_H.SetWindowTextW(str_hex);

	str_hex.Truncate(0);

	str_hex.Format(_T("%02X"), buf_value.ucValue[0]);
	this->m_Edit_Bias_L.SetWindowTextW(str_hex);


	// MOD
	// slider
	m_Slider_MOD.SetRange(VALUE_MOD_MIN, VALUE_MOD_MAX);
	m_Slider_MOD.SetPos(VALUE_MOD_DEF);

	// get static components
	CWnd *pStaticMOD = this->GetDlgItem(IDC_STATIC_MOD);
	CWnd *pStaticMOD_MIN = this->GetDlgItem(IDC_STATIC_MOD_MIN);
	CWnd *pStaticMOD_MAX = this->GetDlgItem(IDC_STATIC_MOD_MAX);

	// set Values
	str.Format(L"%d", VALUE_MOD_MIN);			// Set & Convert
	pStaticMOD_MIN->SetWindowTextW(str);		// Out to Interface control 

	str.Format(L"%d", VALUE_MOD_MAX);			// Set & Convert
	pStaticMOD_MAX->SetWindowTextW(str);		// Out to Interface control 

	str.Format(L"%d", VALUE_MOD_DEF);			// Set & Convert
	pStaticMOD->SetWindowTextW(str);			// Out to Interface control 

	// edit 
	// config
	this->m_Edit_Mod_H.LimitText(2);
	this->m_Edit_Mod_L.LimitText(2);

	// fill with Value
	buf_value.usValue = VALUE_MOD_DEF;

	str_hex.Format(_T("%02X"), buf_value.ucValue[1]);
	this->m_Edit_Mod_H.SetWindowTextW(str_hex);

