mbox54/FT_DSADModService/DSMCUService/ADUC7029_XFP_WDM_CONF_ENGI.cpp
	str_hex.Truncate(0);

	str_hex.Format(_T("%02X"), buf_value.ucValue[0]);
	this->m_Edit_Mod_L.SetWindowTextW(str_hex);
}


void CADUC7029_XFP_WDM_CONF_ENGI::EditHexControl(CEdit * pEdit)
{

}

int CADUC7029_XFP_WDM_CONF_ENGI::TableValues_LoadFromFile(char * v_filename, BYTE * v_ByteData)
{
	// CONST
	const unsigned char uLineCount = 16;
	const unsigned char uByteCount = 16;
	const unsigned char uLetterCount = 2;

	// err status
	unsigned char errLine;

	// position
	unsigned char l;				// active Line
	unsigned char k;				// active Byte
	unsigned char i;				// active Letter (Hex)

									// str Hex buffer
	unsigned char chex_buf[2];

	FILE *fp;


	// [#] FILE OP CHECK
	// > Define Filename

	// set Directory Filename
	char *dir_name = "conf\\";

	// form full filename
	char ch_fname[100];

	BYTE offset_k = 0;
	k = 0;

	BYTE act = 1;
	while (act != 0)
	{
		// [#] mode 1: set directory name
		if (act == 1)
		{
			// check end symbol
			if (dir_name[k] == '\0')
			{
				// [END]

				// switch mode
				act = 2;

				// set dir offset
				offset_k = k;

				// reset index
				k = 0;
			}
			else
			{
				// [NOT END]
				ch_fname[k] = dir_name[k];

				k++;
			}
		} //mode 1 proc
		else
		{
			// [#] mode 2: set file name
			if (act == 2)
			{
				if (v_filename[k] == '\0')
				{
					// [END]

					// set end of full filename string
					ch_fname[k + offset_k] = '\0';

					// switch mode
					act = 0;		// END OP
				}
				else
				{
					// [NOT END]
					ch_fname[k + offset_k] = v_filename[k];

					k++;
				}
			} //mode 2
		} //mode 1 else
	}//while (act != 0)

	 // > Open File try
	errno_t err;
	err = fopen_s(&fp, ch_fname, "r");

	if (err != 0)
	{	// "can't open file" 
		errLine = -1;
		return OP_FAILED;
	}

	// [STATUS OUTPUT]
	CString str_filename;

	k = 0;
	act = 1;
	while (act)
	{
		if (ch_fname[k] == '\0')
		{
			// [END]

			act = 0;
		}
		else
		{
			// [NOT END]

			str_filename.AppendChar(ch_fname[k]);

			k++;
		}
	}

	Trace(_T("File %s  \n"), str_filename);

	// > Define parameters for probress bar
	// count number of Intel Hex file lines
	unsigned int fileLineNum = 0;
	char *e_str;
	char IHline[256];
	while (TRUE)
	{
		e_str = fgets(IHline, sizeof(IHline), fp);
		fileLineNum++;

		// exit condition
		if (e_str == NULL)
		{
			// check line read condition
			if (feof(fp) != 0)
			{	// end of file

				break;
			}
			else
			{	// file corrupted
				errLine = -2;
				//		return MAXQBL_OP_FAILED;
				break;
			}
		}
	}

	// reopen FILE
	fclose(fp);

	err = fopen_s(&fp, ch_fname, "r");

	if (err != 0)
	{	// "can't open file" 
		errLine = -1;

		return OP_FAILED;
	}

	// [STATUS OUTPUT]
	Trace(_T("- lines: %03d \n"), fileLineNum);


	// > Read Data

	// init cycle Read var
	l = 0;
	k = 0;
	i = 0;
	chex_buf[0] = '0';
	chex_buf[1] = '0';


	// Read OP

	// NOTE:
	// FORMAT of file: 
	// H0 H1 H2 H3 H4 H5 H6 H7 H8 H9 HA HB HC HD HE HF // (Line 0x00)
	// ...
	// H0 H1 H2 H3 H4 H5 H6 H7 H8 H9 HA HB HC HD HE HF // (Line 0x0F)
	// where HN - Hex String symbols

	bool ACT = 1;						// reading file op is active
	while (ACT)
	{	// proceed symbol routine

		// > Get symbol
		int c = fgetc(fp);

		// > Select type
		switch (c)
		{
		case EOF:						// [#] cancel on End of File
			ACT = FALSE;
			break;

		case '\n':						// [#] prepare to New Line

			l++;						// line number

			if (l > uLineCount - 1)		// check End of Reading OP
			{
				ACT = FALSE;
			}
			else
			{
				// reset byte number in Line
				k = 0;
			}
			break;

		case ' ':						// [#] prepare to New Byte

			k++;						// Byte number

			if (k > uByteCount - 1)		// check End of Line
			{
				// NOP
				// !probably set error here
			}

			break;


		default:						// [#] all Common text letter symbols
										// [#] Parce Intel Hex line
										// read letter
			chex_buf[i] = c;

			if (i == 0)
			{
				// FIRST letter
				i++;
			}
			else
			{
				// SECOND letter

				// > check valid Symbols
				// make hex string
				CString fileText;
				fileText.AppendChar(chex_buf[0]);
				fileText.AppendChar(chex_buf[1]);

				// valid symbol checking
				CString hexTextValid = fileText.SpanIncluding(_T("0123456789abcdefABCDEF"));

				if (hexTextValid.Compare(fileText) == 0)
				{
					// convert to Byte
					// place to uValues[] Table
					v_ByteData[l * uByteCount + k] = (BYTE)_tcstoul(hexTextValid, NULL, 16);

					// reset letter number
					i = 0;
				}
				else
				{
					// set err number equal to Line number
					errLine = l;

					return OP_FAILED;
				} // if compare
			}

			break;

		} // switch c
	} // while ACT


	  // > Close Intel Hex File
	fclose(fp);


	return OP_SUCCESS;
}

int CADUC7029_XFP_WDM_CONF_ENGI::TableValues_SaveToFile(BYTE * v_ByteData)
{
	// CONST
	// # define COUNT of Byte in Line
	const unsigned char LINE_BYTE_COUNT = 16;

	const unsigned char uLineCount = 16;
	const unsigned char uByteCount = 16;
	const unsigned char uLetterCount = 2;

	// err status
	unsigned char errLine;

	// position
	unsigned char l;				// active Line
	unsigned char k;				// active Byte
	unsigned char i;				// active Letter (Hex)

									// str Hex buffer
	unsigned char chex_buf[2];

	FILE *fp;


	// [#] FILE OP CHECK
	// > Define Filename
	CString str_filename("test.conf");
	char *file_name = "test.conf";

	// > Open File try
	errno_t err;

	char ch_fname[200];
	for (int k = 0; k < str_filename.GetLength(); k++)
	{
		ch_fname[k] = str_filename[k];
	}

	ch_fname[str_filename.GetLength()] = '\0';

	err = fopen_s(&fp, ch_fname, "w");

	if (err != 0)
	{	// "can't open file" 
		errLine = -1;
		return OP_FAILED;
	}

	// [STATUS OUTPUT]
	Trace(_T("File %s  \n"), str_filename);


	// > Write Data

	// NOTE:
	// FORMAT of file: 
	// H0 H1 H2 H3 H4 H5 H6 H7 H8 H9 HA HB HC HD HE HF // (Line 0x00)
	// ...
	// H0 H1 H2 H3 H4 H5 H6 H7 H8 H9 HA HB HC HD HE HF // (Line 0x0F)
	// where HN - Hex String symbols

	// init cycle Write var
	l = 0;
	k = 0;

	//
	unsigned char cbyte_line[LINE_BYTE_COUNT];

	bool ACT = 1;							// writing file op is active
	while (ACT)
	{
		// fill the Line
		cbyte_line[k] = v_ByteData[l * uByteCount + k];

		if (k > uByteCount - 2)				// check End of Line
		{
			// > forming Line

			// make string of hex
			CString fileHexSymbol;
			CString fileHexLine;

