mbox54/FT_DSADModService/DSMCUService/ADUC7029_XFP_WDM_CONF_ENGI.cpp
			for (unsigned char ik = 0; ik < uByteCount; ik++)
			{
				fileHexSymbol.Format(_T("%02X"), cbyte_line[ik]);

				fileHexLine.Append(fileHexSymbol);
				fileHexLine.AppendChar(' ');
			}

			// make null_string Line_of_char to write in file
			// NOTE:
			// FORMAT: 'H' 'H' ' ', ... , 'H' 'H' \n \0
			char chex_line[uByteCount * 3 + 1];

			for (unsigned char ik = 0; ik < uByteCount * 3 - 1; ik++)
			{
				chex_line[ik] = fileHexLine[ik];
			}

			// add line ender
			chex_line[uByteCount * 3 - 1] = '\n';
			chex_line[uByteCount * 3] = '\0';

			// write string to file
			fputs(chex_line, fp);


			if (l > uLineCount - 2)			// check End of Reading OP
			{
				ACT = FALSE;
			}
			else
			{
				// prepare new Line
				l++;

				// reset Byte number in Line
				k = 0;
			}
		}
		else
		{
			k++;
		}
	} // 


	  // > Close Intel Hex File
	fclose(fp);


	return OP_SUCCESS;
}

void CADUC7029_XFP_WDM_CONF_ENGI::NoUpdateRead()
{
	Trace(_T("ÔÓÔ˚ÚÍ‡: ◊“≈Õ»≈\n"));
	Trace(_T("Ô‡‡ÏÂÚ˚: A2-T10-PASS, 256 ·‡ÈÚ\n"));


	// Valid ConfigTable Values
	unsigned char v_TablName[1] = { 0x10 };
	//	unsigned char v_TablPass[4] = { 'O', 'P', 'W', 'Y' };
	unsigned char v_TablPass[4]; // = { 0x00, 0x11, 0x22, 0x33 };


								 // get Password 4Bytes
	UpdateData(TRUE);

	CString strHex;

	// !debug _pass letters
	//for (unsigned char k = 0; k < 4; k++)
	//{
	//	char cPassLetter[2];
	//	cPassLetter[0] = m_sEdit_PassValue[k * 2];
	//	cPassLetter[1] = m_sEdit_PassValue[k * 2 + 1];

	//	strHex.AppendChar(cPassLetter[0]);
	//	strHex.AppendChar(cPassLetter[1]);

	//	// convert to Byte
	//	unsigned char byte_passLetter;
	//	byte_passLetter = (BYTE)_tcstoul(strHex, NULL, 16);

	//	v_TablPass[k] = byte_passLetter;

	//	strHex.Truncate(0);
	//}

	unsigned char v_WrByte[1];

	// progress component
	p_cPB_OP->SetPos(0);

	// send Table
	// write tabl in Device
	BYTE retVal = m_Grid.DeviceSlave_Write(v_TablName, SLAVEADDR_A0, 0x7F, 1);
	if (retVal != HID_SMBUS_SUCCESS)
	{
		Trace(_T("Œÿ»¡ ¿. [ÍÓ‰: %02d] \n"), retVal);
		Trace(_T("Õ¿ ›“¿œ≈: ¬€¡Œ– “¿¡À»÷€ \n"), retVal);
	}

	//if (retVal == HID_SMBUS_SUCCESS)
	//{
	//	Sleep(30);

	//	p_cPB_OP->SetPos(30);

	//	// send password
	//	// write pass in Device
	//	for (unsigned char k = 0; k < 4; k++)
	//	{
	//		v_WrByte[0] = v_TablPass[k];
	//		retVal = m_Grid.DeviceSlave_Write(v_WrByte, SLAVEADDR_A2, 0x7B + k, 1);

	//		if (retVal != HID_SMBUS_SUCCESS)
	//		{
	//			Trace(_T("Œÿ»¡ ¿. [ÍÓ‰: %02d] \n"), retVal);
	//			Trace(_T("Õ¿ ›“¿œ≈: ¬¬Œƒ œ¿–ŒÀﬂ \n"), retVal);

	//			break;
	//		}

	//		Sleep(10);

	//		p_cPB_OP->SetPos(30 + 5 * k);
	//	}
	//}

	if (retVal == HID_SMBUS_SUCCESS)
	{
		// Read op
		Sleep(30);

		p_cPB_OP->SetPos(80);

		//m_Grid.DeviceSlave_ReadTimer(uValues2, 0, SLAVEADDR_A2, 0, 256, 0, 0);
		retVal = m_Grid.DeviceSlave_Read(uValues2, SLAVEADDR_A0, 0x80, 128);

		if (retVal != HID_SMBUS_SUCCESS)
		{
			// error: Device Read
			Trace(_T("Œÿ»¡ ¿. [ÍÓ‰: %02d] \n"), retVal);
			Trace(_T("Õ¿ ›“¿œ≈: «¿√–”« ¿ “¿¡À»÷€ \n"), retVal);
		}
	}

	if (retVal != HID_SMBUS_SUCCESS)
	{
		CString str_ErrText;
		switch (retVal)
		{
		case 1:
			str_ErrText.AppendFormat(L"(MAXQBL_NO_DEVICE)");

			break;

		case 2:
			str_ErrText.AppendFormat(L"(MAXQBL_DEV_INACCESSIBLE)");

			break;

		case 3:
			str_ErrText.AppendFormat(L"(MAXQBL_OP_FAILED)");

			break;

		case 4:
			str_ErrText.AppendFormat(L"(MAXQBL_OP_WRONG)");

			break;

		default:
			break;
		}

		// err comment output
		Trace(str_ErrText, '\n');
		Trace(_T("-----------------------\n"));

		return;
	}

	Trace(_T("”—œ≈ÿÕŒ.\n"));
	Trace(_T("-----------------------\n"));

	m_Grid.GridSFF_Write(uValues2, 0x80, 128);

	p_cPB_OP->SetPos(100);

}


void CADUC7029_XFP_WDM_CONF_ENGI::UpdateRead()
{
	NoUpdateRead();

	// > Update Output Controls
	// > > Get Table Values
	BYTE uValues[256];
	m_Grid.GridSFF_Read(uValues, 0x80, 128);

	// > > Set Sliders Position
	// [SLIDER BIAS]
	// Get Value
	unWORD_2BYTE buf_value;

	buf_value.ucValue[1] = (uValues[ADDR_BIAS_HI] & 0x03);
	buf_value.ucValue[0] = uValues[ADDR_BIAS_LO];

	// Set Slider Control
	this->m_Slider_BIAS.SetPos(buf_value.usValue);

	// Set Static Control
	CString strValue;
	strValue.Format(L"%d", buf_value.usValue);

	CWnd *pStaticBIAS = this->GetDlgItem(IDC_STATIC_BIAS);
	pStaticBIAS->SetWindowTextW(strValue);

	// Set Edit Control
	strValue.Truncate(0);
	strValue.Format(_T("%02X"), buf_value.ucValue[1]);
	this->m_Edit_Bias_H.SetWindowTextW(strValue);

	strValue.Truncate(0);
	strValue.Format(_T("%02X"), buf_value.ucValue[0]);
	this->m_Edit_Bias_L.SetWindowTextW(strValue);


	//// [SLIDER MOD]
	//// Get Value
	//unComplexValue.strucValue.ucByte02 = uValues[0x80 + ADDR_MOD];
	//unComplexValue.strucValue.ucByte01 = uValues[0x80 + ADDR_MOD + 1];

	//// Set Slider Control
	//this->m_Slider_MOD.SetPos(unComplexValue.usWordValue);

	//// Set Static Control
	//strValue.Truncate(0);
	//strValue.Format(L"%d", unComplexValue.usWordValue);

	//CWnd *pStaticMOD = this->GetDlgItem(IDC_STATIC_MOD);
	//pStaticMOD->SetWindowTextW(strValue);

	//// Set Edit Control
	//strValue.Truncate(0);
	//strValue.Format(_T("%02X"), unComplexValue.strucValue.ucByte02);
	//this->m_Edit_Mod_H.SetWindowTextW(strValue);

	//strValue.Truncate(0);
	//strValue.Format(_T("%02X"), unComplexValue.strucValue.ucByte01);
	//this->m_Edit_Mod_L.SetWindowTextW(strValue);

	// > Update interface for Write controls
	UpdateData(FALSE);

}


void CADUC7029_XFP_WDM_CONF_ENGI::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
	DDX_Control(pDX, IDC_GRID, m_Grid);
	DDX_Text(pDX, IDC_EDIT_PASSVALUE, m_sEdit_PassValue);
	DDX_Text(pDX, IDC_EDIT_FILENAME, m_Edit_Filename);
	DDX_Control(pDX, IDC_SLIDER_BIAS, m_Slider_BIAS);
	DDX_Control(pDX, IDC_SLIDER_MOD, m_Slider_MOD);
	DDX_Control(pDX, IDC_EDIT_BIAS_H, m_Edit_Bias_H);
	DDX_Control(pDX, IDC_EDIT_BIAS_L, m_Edit_Bias_L);
	DDX_Control(pDX, IDC_EDIT_MOD_H, m_Edit_Mod_H);
	DDX_Control(pDX, IDC_EDIT_MOD_L, m_Edit_Mod_L);
}


BEGIN_MESSAGE_MAP(CADUC7029_XFP_WDM_CONF_ENGI, CDialog)

	// Grid event functions
	ON_NOTIFY(NM_CLICK, IDC_GRID, OnGridClick)
	ON_NOTIFY(GVN_ENDLABELEDIT, IDC_GRID, OnGridEndEdit)


	ON_BN_CLICKED(IDC_BUTTON4, &CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButton4)
	ON_BN_CLICKED(IDC_BUTTON5, &CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButton5)
	ON_BN_CLICKED(IDC_BUTTON_BIAS_SET, &CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButtonBiasSet)
	ON_BN_CLICKED(IDC_BUTTON_MOD_SET, &CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButtonModSet)
	ON_BN_CLICKED(IDC_BUTTON_HOR_SET, &CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButtonHorSet)
	ON_BN_CLICKED(IDC_BUTTON_VERTICAL_SET, &CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButtonVerticalSet)
	ON_WM_HSCROLL()
	ON_WM_VSCROLL()
END_MESSAGE_MAP()


// CADUC7029_XFP_WDM_CONF_ENGI message handlers


BOOL CADUC7029_XFP_WDM_CONF_ENGI::OnInitDialog()
{
	CDialog::OnInitDialog();

	// TODO:  Add extra initialization here
	m_Grid.Init();

	// > Sliders
	SliderInit();

	// > Password
	m_sEdit_PassValue = (CString)"00112233";

	// > Confic File Default
	m_Edit_Filename = (CString)"test.conf";

	UpdateData(FALSE);

	return TRUE;  // return TRUE unless you set the focus to a control
				  // EXCEPTION: OCX Property Pages should return FALSE
}

void CADUC7029_XFP_WDM_CONF_ENGI::OnGridClick(NMHDR * pNotifyStruct, LRESULT * pResult)
{
	NM_GRIDVIEW* pItem = (NM_GRIDVIEW*)pNotifyStruct;
	Trace(_T("Clicked on row %d, col %d\n"), pItem->iRow, pItem->iColumn);
	Trace(_T("Text: %s\n"), m_Grid.GetItemText(pItem->iRow, pItem->iColumn));
	//Item.strText
}

void CADUC7029_XFP_WDM_CONF_ENGI::OnGridEndEdit(NMHDR * pNotifyStruct, LRESULT * pResult)
{
	NM_GRIDVIEW* pItem = (NM_GRIDVIEW*)pNotifyStruct;
	Trace(_T("End Edit on row %d, col %d\n"), pItem->iRow, pItem->iColumn);

