mbox54/FT_DSADModService/DSMCUService/ADUC7029_XFP_WDM_CONF_ENGI.cpp
	// > check Valid Input
	bool bInvalid = m_Grid.CheckValidHex(pItem->iRow, pItem->iColumn);

	*pResult = (bInvalid || m_Grid.m_bRejectEditChanges) ? -1 : 0;

	Trace(_T("Res: %d\n"), bInvalid && m_Grid.m_bRejectEditChanges);
}


// Read OP
void CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButton4()
{
	// Do Read Table PROC
	// with update controls
	UpdateRead();

}

// Write OP
void CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButton5()
{
	Trace(_T("ÔÓÔ˚ÚÍ‡: Œ¡ÕŒ¬À≈Õ»≈ \n"));
	Trace(_T("Ô‡‡ÏÂÚ˚: A0-T10-PASS, 128 ·‡ÈÚ\n"));

	// Valid ConfigTable Values
	unsigned char v_TablName[1] = { 0x10 };
	//	unsigned char v_TablPass[4] = { 'O', 'P', 'W', 'Y' };
	unsigned char v_TablPass[4]; // = { 0x00, 0x11, 0x22, 0x33 };


	// get Password 4Bytes
	UpdateData(TRUE);

	CString strHex;

	// !debug _convert pass symbols
	//for (unsigned char k = 0; k < 4; k++)
	//{
	//	char cPassLetter[2];
	//	cPassLetter[0] = m_sEdit_PassValue[k * 2];
	//	cPassLetter[1] = m_sEdit_PassValue[k * 2 + 1];

	//	strHex.AppendChar(cPassLetter[0]);
	//	strHex.AppendChar(cPassLetter[1]);

	//	// convert to Byte
	//	unsigned char byte_passLetter;
	//	byte_passLetter = (BYTE)_tcstoul(strHex, NULL, 16);

	//	v_TablPass[k] = byte_passLetter;

	//	strHex.Truncate(0);
	//}

	// progress component
	p_cPB_OP->SetPos(0);

	// send Table
	// write tabl in Device
	BYTE retVal = m_Grid.DeviceSlave_Write(v_TablName, SLAVEADDR_A0, 0x7F, 1);
	if (retVal != HID_SMBUS_SUCCESS)
	{
		Trace(_T("Œÿ»¡ ¿. [ÍÓ‰: %02d] \n"), retVal);
		Trace(_T("Õ¿ ›“¿œ≈: ¬€¡Œ– “¿¡À»÷€ \n"), retVal);
	}

	// !debug pass set
	//if (retVal == HID_SMBUS_SUCCESS)
	//{
	//	Sleep(30);

	//	p_cPB_OP->SetPos(20);

	//	// send password
	//	// write pass in Device
	//	retVal = m_Grid.DeviceSlave_Write(v_TablPass, SLAVEADDR_A2, 0x7B, 4);

	//	if (retVal != HID_SMBUS_SUCCESS)
	//	{
	//		Trace(_T("Œÿ»¡ ¿. [ÍÓ‰: %02d] \n"), retVal);
	//		Trace(_T("Õ¿ ›“¿œ≈: ¬¬Œƒ œ¿–ŒÀﬂ \n"), retVal);
	//	}

	//	Sleep(30);

	//	p_cPB_OP->SetPos(40);
	//}

	if (retVal == HID_SMBUS_SUCCESS)
	{
		// NOTE:
		// it is must to:
		// write ALL 128 bytes of TABLE
		unsigned char v_GridVal_T10[128];
		unsigned char v_WrByte32[32];

		// get Values
		m_Grid.GridSFF_Read(v_GridVal_T10, 0x80, 128);

		// Write to Device
		BYTE retVal = m_Grid.DeviceSlave_Write(v_GridVal_T10, SLAVEADDR_A0, 0x80, 128);

		// !debug 8BYTE regime
		for (int k = 0; k < 4; k++)
		{
			// prepare write buffer
			for (int k2 = 0; k2 < 32; k2++)
			{
				v_WrByte32[k2] = v_GridVal_T10[k * 32 + k2];
			}

			// i2c write
			retVal = m_Grid.DeviceSlave_Write(v_WrByte32, SLAVEADDR_A2, 0x80 + k * 32, 32);

			if (retVal != HID_SMBUS_SUCCESS)
			{
				// error: Device Read
				Trace(_T("Œÿ»¡ ¿. [ÍÓ‰: %02d] \n"), retVal);
				Trace(_T("Õ¿ ›“¿œ≈: Œ¡ÕŒ¬À≈Õ»≈ “¿¡À»÷€ \n"), retVal);
			}

			p_cPB_OP->SetPos(40 + k * 15);

			Sleep(300);
		}
	}

	if (retVal != HID_SMBUS_SUCCESS)
	{
		CString str_ErrText;
		switch (retVal)
		{
		case 1:
			str_ErrText.AppendFormat(L"(MAXQBL_NO_DEVICE)");

			break;

		case 2:
			str_ErrText.AppendFormat(L"(MAXQBL_DEV_INACCESSIBLE)");

			break;

		case 3:
			str_ErrText.AppendFormat(L"(MAXQBL_OP_FAILED)");

			break;

		case 4:
			str_ErrText.AppendFormat(L"(MAXQBL_OP_WRONG)");

			break;

		default:
			break;
		}

		// err comment output
		Trace(str_ErrText, '\n');
		Trace(_T("-----------------------\n"));

		return;
	}

	Trace(_T("”—œ≈ÿÕŒ.\n"));
	Trace(_T("-----------------------\n"));

	p_cPB_OP->SetPos(100);
	//	m_Grid.DeviceSlave_WriteTimer(uValues2, 0, SLAVEADDR_A2, 128 + 8, 8, 0, 0);
}




void CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButtonBiasSet()
{
	// TODO: Add your control notification handler code here
}


void CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButtonModSet()
{
	// TODO: Add your control notification handler code here
}


void CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButtonHorSet()
{
	// TODO: Add your control notification handler code here
}


void CADUC7029_XFP_WDM_CONF_ENGI::OnBnClickedButtonVerticalSet()
{
	// TODO: Add your control notification handler code here
}

